program(1.3)
[buildInfo = dict<string, string>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3505.4.1"}, {"coremltools-component-milinternal", ""}, {"coremltools-version", "9.0"}})]
{
    func main<ios18>(tensor<fp16, [1, 768, 1, 32]> x) {
        tensor<fp16, [1,768,1,32]> sq = mul(x=x,y=x)[name=string("sq")];
        tensor<int32, [1]> raxCh = const()[name=string("rax_ch"), val=tensor<int32, [1]>([1])];
        tensor<int32, [1]> raxSp = const()[name=string("rax_sp"), val=tensor<int32, [1]>([3])];
        bool kd = const()[name=string("kd"), val=bool(true)];
        tensor<fp16, [1,1,1,32]> ss = reduce_sum(x=sq,axes=raxCh,keep_dims=kd)[name=string("ss")];
        fp16 invd = const()[name=string("invd"), val=fp16(0.001302)];
        tensor<fp16, [1,1,1,32]> ss2 = mul(x=ss,y=invd)[name=string("ss2")];
        fp16 eps = const()[name=string("eps"), val=fp16(0.00001)];
        tensor<fp16, [1,1,1,32]> ss3 = add(x=ss2,y=eps)[name=string("ss3")];
        fp16 nhalf = const()[name=string("nhalf"), val=fp16(-0.5)];
        tensor<fp16, [1,1,1,32]> rrms = pow(x=ss3,y=nhalf)[name=string("rrms")];
        tensor<fp16, [1,768,1,32]> xr = mul(x=x,y=rrms)[name=string("xr")];
        tensor<fp16, [1,768,1,1]> rw = const()[name=string("rw"), val=tensor<fp16, [1,768,1,1]>(BLOBFILE(path=string("@model_path/weights/rms2.bin"), offset=uint64(64)))];
        tensor<fp16, [1,768,1,32]> xn = mul(x=xr,y=rw)[name=string("xn")];
        string pt = const()[name=string("pt"), val=string("valid")];
        tensor<int32, [2]> st = const()[name=string("st"), val=tensor<int32, [2]>([1,1])];
        tensor<int32, [4]> pd = const()[name=string("pd"), val=tensor<int32, [4]>([0,0,0,0])];
        tensor<int32, [2]> dl = const()[name=string("dl"), val=tensor<int32, [2]>([1,1])];
        int32 gr = const()[name=string("gr"), val=int32(1)];
        tensor<fp16, [2048,768,1,1]> W1 = const()[name=string("W1"), val=tensor<fp16, [2048,768,1,1]>(BLOBFILE(path=string("@model_path/weights/w1.bin"), offset=uint64(64)))];
        tensor<fp16, [2048,768,1,1]> W3 = const()[name=string("W3"), val=tensor<fp16, [2048,768,1,1]>(BLOBFILE(path=string("@model_path/weights/w3.bin"), offset=uint64(64)))];
        tensor<fp16, [768,2048,1,1]> W2 = const()[name=string("W2"), val=tensor<fp16, [768,2048,1,1]>(BLOBFILE(path=string("@model_path/weights/w2.bin"), offset=uint64(64)))];
        tensor<fp16, [1,2048,1,32]> h1 = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=W1,x=xn)[name=string("c1")];
        tensor<fp16, [1,2048,1,32]> h3 = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=W3,x=xn)[name=string("c3")];
        tensor<fp16, [1,2048,1,32]> sig = sigmoid(x=h1)[name=string("sg")];
        tensor<fp16, [1,2048,1,32]> silu = mul(x=h1,y=sig)[name=string("si")];
        tensor<fp16, [1,2048,1,32]> gate = mul(x=silu,y=h3)[name=string("gt")];
        tensor<fp16, [1,768,1,32]> y = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=W2,x=gate)[name=string("c2")];
        tensor<fp16, [1,768,1,32]> out = add(x=x,y=y)[name=string("res")];
    } -> (out);
}
