program(1.3)
[buildInfo = dict<string, string>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3505.4.1"}, {"coremltools-component-milinternal", ""}, {"coremltools-version", "9.0"}})]
{
    func main<ios18>(tensor<fp16, [1, 4864, 1, 256]> x) {
        string pt = const()[name=string("pt"), val=string("valid")];
        tensor<int32, [2]> st = const()[name=string("st"), val=tensor<int32, [2]>([1,1])];
        tensor<int32, [4]> pd = const()[name=string("pd"), val=tensor<int32, [4]>([0,0,0,0])];
        tensor<int32, [2]> dl = const()[name=string("dl"), val=tensor<int32, [2]>([1,1])];
        int32 gr = const()[name=string("gr"), val=int32(1)];
        tensor<int32, [4]> bd = const()[name=string("bd"), val=tensor<int32, [4]>([0,0,0,0])];
        tensor<int32, [4]> sd = const()[name=string("sd"), val=tensor<int32, [4]>([1,768,1,256])];
        tensor<fp16, [1,768,1,256]> dffn = slice_by_size(x=x,begin=bd,size=sd)[name=string("s0")];
        tensor<int32, [4]> b1 = const()[name=string("b1"), val=tensor<int32, [4]>([0,768,0,0])];
        tensor<int32, [4]> s1 = const()[name=string("s1"), val=tensor<int32, [4]>([1,2048,1,256])];
        tensor<fp16, [1,2048,1,256]> h1 = slice_by_size(x=x,begin=b1,size=s1)[name=string("s1x")];
        tensor<int32, [4]> b3 = const()[name=string("b3"), val=tensor<int32, [4]>([0,2816,0,0])];
        tensor<fp16, [1,2048,1,256]> h3 = slice_by_size(x=x,begin=b3,size=s1)[name=string("s3x")];
        tensor<fp16, [2048,768,1,1]> W2t = const()[name=string("W2t"), val=tensor<fp16, [2048,768,1,1]>(BLOBFILE(path=string("@model_path/weights/w2t.bin"), offset=uint64(64)))];
        tensor<fp16, [1,2048,1,256]> dsilu = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=W2t,x=dffn)[name=string("cw2")];
        tensor<fp16, [1,2048,1,256]> sig = sigmoid(x=h1)[name=string("sg")];
        fp16 one = const()[name=string("one"), val=fp16(1.0)];
        tensor<fp16, [1,2048,1,256]> oms = sub(x=one,y=sig)[name=string("oms")];
        tensor<fp16, [1,2048,1,256]> homs = mul(x=h1,y=oms)[name=string("homs")];
        tensor<fp16, [1,2048,1,256]> brk = add(x=one,y=homs)[name=string("brk")];
        tensor<fp16, [1,2048,1,256]> dsd = mul(x=sig,y=brk)[name=string("dsd")];
        tensor<fp16, [1,2048,1,256]> t1 = mul(x=dsilu,y=h3)[name=string("t1")];
        tensor<fp16, [1,2048,1,256]> dh1 = mul(x=t1,y=dsd)[name=string("dh1")];
        tensor<fp16, [1,2048,1,256]> slh = mul(x=h1,y=sig)[name=string("slh")];
        tensor<fp16, [1,2048,1,256]> dh3 = mul(x=dsilu,y=slh)[name=string("dh3")];
        tensor<fp16, [768,2048,1,1]> W1t = const()[name=string("W1t"), val=tensor<fp16, [768,2048,1,1]>(BLOBFILE(path=string("@model_path/weights/w1t.bin"), offset=uint64(64)))];
        tensor<fp16, [768,2048,1,1]> W3t = const()[name=string("W3t"), val=tensor<fp16, [768,2048,1,1]>(BLOBFILE(path=string("@model_path/weights/w3t.bin"), offset=uint64(64)))];
        tensor<fp16, [1,768,1,256]> dx1 = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=W1t,x=dh1)[name=string("cw1")];
        tensor<fp16, [1,768,1,256]> dx3 = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=W3t,x=dh3)[name=string("cw3")];
        tensor<fp16, [1,768,1,256]> dx = add(x=dx1,y=dx3)[name=string("adx")];
        int32 cax = const()[name=string("cax"), val=int32(1)];
        bool cid = const()[name=string("cid"), val=bool(false)];
        tensor<fp16, [1,4864,1,256]> out = concat(axis=cax,interleave=cid,values=(dx,dh1,dh3))[name=string("cat")];
    } -> (out);
}
