program(1.3)
[buildInfo = dict<string, string>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3505.4.1"}, {"coremltools-component-milinternal", ""}, {"coremltools-version", "9.0"}})]
{
    func main<ios18>(tensor<fp16, [1, 768, 1, 32]> x, tensor<fp16, [1, 3072, 1, 256]> packedKVCache, tensor<fp16, [1, 768, 1, 256]> maskCache0, tensor<fp16, [1, 768, 1, 256]> maskCache1) {
        tensor<int32, [1]> raxCh = const()[name=string("rax_ch"), val=tensor<int32, [1]>([1])];
        tensor<int32, [1]> raxSp = const()[name=string("rax_sp"), val=tensor<int32, [1]>([3])];
        bool kd = const()[name=string("kd"), val=bool(true)];
        fp16 invd = const()[name=string("invd"), val=fp16(0.001302)];
        fp16 eps = const()[name=string("eps"), val=fp16(0.00001)];
        fp16 nhalf = const()[name=string("nhalf"), val=fp16(-0.5)];
        string pt = const()[name=string("pt"), val=string("valid")];
        tensor<int32, [2]> st = const()[name=string("st"), val=tensor<int32, [2]>([1,1])];
        tensor<int32, [4]> pd = const()[name=string("pd"), val=tensor<int32, [4]>([0,0,0,0])];
        tensor<int32, [2]> dl = const()[name=string("dl"), val=tensor<int32, [2]>([1,1])];
        int32 gr = const()[name=string("gr"), val=int32(1)];
        tensor<int32, [4]> kv_b0 = const()[name=string("kv_b0"), val=tensor<int32, [4]>([0,0,0,0])];
        tensor<int32, [4]> kv_b1 = const()[name=string("kv_b1"), val=tensor<int32, [4]>([0,768,0,0])];
        tensor<int32, [4]> kv_b2 = const()[name=string("kv_b2"), val=tensor<int32, [4]>([0,1536,0,0])];
        tensor<int32, [4]> kv_b3 = const()[name=string("kv_b3"), val=tensor<int32, [4]>([0,2304,0,0])];
        tensor<int32, [4]> kv_sz = const()[name=string("kv_sz"), val=tensor<int32, [4]>([1,768,1,256])];
        tensor<fp16, [1,768,1,256]> kCache = slice_by_size(x=packedKVCache,begin=kv_b0,size=kv_sz)[name=string("kv_l0_k")];
        tensor<fp16, [1,768,1,256]> vCache = slice_by_size(x=packedKVCache,begin=kv_b1,size=kv_sz)[name=string("kv_l0_v")];
        tensor<fp16, [1,768,1,256]> l1_kCache = slice_by_size(x=packedKVCache,begin=kv_b2,size=kv_sz)[name=string("kv_l1_k")];
        tensor<fp16, [1,768,1,256]> l1_vCache = slice_by_size(x=packedKVCache,begin=kv_b3,size=kv_sz)[name=string("kv_l1_v")];
        tensor<fp16, [1,768,1,32]> sq = mul(x=x,y=x)[name=string("sq")];
        tensor<fp16, [1,1,1,32]> ss = reduce_sum(x=sq,axes=raxCh,keep_dims=kd)[name=string("ss")];
        tensor<fp16, [1,1,1,32]> ss2 = mul(x=ss,y=invd)[name=string("ss2")];
        tensor<fp16, [1,1,1,32]> ss3 = add(x=ss2,y=eps)[name=string("ss3")];
        tensor<fp16, [1,1,1,32]> rrms = pow(x=ss3,y=nhalf)[name=string("rrms")];
        tensor<fp16, [1,768,1,32]> xr = mul(x=x,y=rrms)[name=string("xr")];
        tensor<fp16, [1,768,1,1]> rw = const()[name=string("rw"), val=tensor<fp16, [1,768,1,1]>(BLOBFILE(path=string("@model_path/weights/l0_rms1.bin"), offset=uint64(64)))];
        tensor<fp16, [1,768,1,32]> xn = mul(x=xr,y=rw)[name=string("xn")];
        tensor<fp16, [768,768,1,1]> Wq = const()[name=string("Wq"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/l0_wq.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> Wk = const()[name=string("Wk"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/l0_wk.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> Wv = const()[name=string("Wv"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/l0_wv.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> Wo = const()[name=string("Wo"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/l0_wo.bin"), offset=uint64(64)))];
        tensor<fp16, [1,768,1,32]> qfFull = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=Wq,x=xn)[name=string("cq")];
        tensor<fp16, [1,768,1,32]> kfL0 = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=Wk,x=xn)[name=string("ck")];
        tensor<fp16, [1,768,1,32]> vfL0 = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=Wv,x=xn)[name=string("cv")];
        tensor<fp16, [1,768,1,1]> qf = reduce_sum(x=qfFull,axes=raxSp,keep_dims=kd)[name=string("qf")];
        tensor<int32, [4]> bMask = const()[name=string("b_mask"), val=tensor<int32, [4]>([0,0,0,0])];
        tensor<int32, [4]> szMask = const()[name=string("sz_mask"), val=tensor<int32, [4]>([1,1,1,256])];
        tensor<fp16, [1,1,1,256]> maskVec = slice_by_size(x=maskCache0,begin=bMask,size=szMask)[name=string("mask_vec")];
        tensor<fp16, [1,1,1,256]> kCh = reduce_sum(x=kCache,axes=raxCh,keep_dims=kd)[name=string("k_ch")];
        tensor<fp16, [1,1,1,256]> vCh = reduce_sum(x=vCache,axes=raxCh,keep_dims=kd)[name=string("v_ch")];
        tensor<fp16, [1,1,1,1]> kS = reduce_sum(x=kCh,axes=raxSp,keep_dims=kd)[name=string("k_s")];
        tensor<fp16, [1,1,1,1]> vS = reduce_sum(x=vCh,axes=raxSp,keep_dims=kd)[name=string("v_s")];
        fp16 zc = const()[name=string("zc"), val=fp16(0.0)];
        tensor<fp16, [1,1,1,256]> mask0 = mul(x=maskVec,y=zc)[name=string("mask0")];
        tensor<fp16, [1,1,1,1]> mS = reduce_sum(x=mask0,axes=raxSp,keep_dims=kd)[name=string("m_s")];
        tensor<fp16, [1,1,1,1]> qS = reduce_sum(x=qf,axes=raxCh,keep_dims=kd)[name=string("q_s")];
        tensor<fp16, [1,768,1,1]> ooProbe = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=Wo,x=qf)[name=string("co_probe")];
        tensor<fp16, [1,1,1,1]> oS = reduce_sum(x=ooProbe,axes=raxCh,keep_dims=kd)[name=string("o_s")];
        tensor<fp16, [1,1,1,1]> kv = add(x=kS,y=vS)[name=string("kv")];
        tensor<fp16, [1,1,1,1]> kvm1 = add(x=kv,y=mS)[name=string("kvm1")];
        tensor<fp16, [1,1,1,1]> kvm2 = add(x=kvm1,y=qS)[name=string("kvm2")];
        tensor<fp16, [1,1,1,1]> kvm = add(x=kvm2,y=oS)[name=string("kvm")];
        tensor<fp16, [1,1,1,1]> z = mul(x=kvm,y=zc)[name=string("z")];
        tensor<fp16, [1,768,1,32]> x2 = add(x=x,y=z)[name=string("res")];
        tensor<fp16, [1,768,1,32]> f_sq = mul(x=x2,y=x2)[name=string("f_sq")];
        tensor<fp16, [1,1,1,32]> f_ss = reduce_sum(x=f_sq,axes=raxCh,keep_dims=kd)[name=string("f_ss")];
        tensor<fp16, [1,1,1,32]> f_ss2 = mul(x=f_ss,y=invd)[name=string("f_ss2")];
        tensor<fp16, [1,1,1,32]> f_ss3 = add(x=f_ss2,y=eps)[name=string("f_ss3")];
        tensor<fp16, [1,1,1,32]> f_rrms = pow(x=f_ss3,y=nhalf)[name=string("f_rrms")];
        tensor<fp16, [1,768,1,32]> f_xr = mul(x=x2,y=f_rrms)[name=string("f_xr")];
        tensor<fp16, [1,768,1,1]> f_rw = const()[name=string("f_rw"), val=tensor<fp16, [1,768,1,1]>(BLOBFILE(path=string("@model_path/weights/l0_rms2.bin"), offset=uint64(64)))];
        tensor<fp16, [1,768,1,32]> f_xn = mul(x=f_xr,y=f_rw)[name=string("f_xn")];
        tensor<fp16, [2048,768,1,1]> W1 = const()[name=string("W1"), val=tensor<fp16, [2048,768,1,1]>(BLOBFILE(path=string("@model_path/weights/l0_w1.bin"), offset=uint64(64)))];
        tensor<fp16, [2048,768,1,1]> W3 = const()[name=string("W3"), val=tensor<fp16, [2048,768,1,1]>(BLOBFILE(path=string("@model_path/weights/l0_w3.bin"), offset=uint64(64)))];
        tensor<fp16, [768,2048,1,1]> W2 = const()[name=string("W2"), val=tensor<fp16, [768,2048,1,1]>(BLOBFILE(path=string("@model_path/weights/l0_w2.bin"), offset=uint64(64)))];
        tensor<fp16, [1,2048,1,32]> h1 = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=W1,x=f_xn)[name=string("c1")];
        tensor<fp16, [1,2048,1,32]> h3 = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=W3,x=f_xn)[name=string("c3")];
        tensor<fp16, [1,2048,1,32]> sig = sigmoid(x=h1)[name=string("sg")];
        tensor<fp16, [1,2048,1,32]> silu = mul(x=h1,y=sig)[name=string("si")];
        tensor<fp16, [1,2048,1,32]> gate = mul(x=silu,y=h3)[name=string("gt")];
        tensor<fp16, [1,768,1,32]> y = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=W2,x=gate)[name=string("c2")];
        tensor<fp16, [1,768,1,32]> xMid = add(x=x2,y=y)[name=string("res2")];
        tensor<fp16, [1,768,1,32]> l1_sq = mul(x=xMid,y=xMid)[name=string("l1_sq")];
        tensor<fp16, [1,1,1,32]> l1_ss = reduce_sum(x=l1_sq,axes=raxCh,keep_dims=kd)[name=string("l1_ss")];
        tensor<fp16, [1,1,1,32]> l1_ss2 = mul(x=l1_ss,y=invd)[name=string("l1_ss2")];
        tensor<fp16, [1,1,1,32]> l1_ss3 = add(x=l1_ss2,y=eps)[name=string("l1_ss3")];
        tensor<fp16, [1,1,1,32]> l1_rrms = pow(x=l1_ss3,y=nhalf)[name=string("l1_rrms")];
        tensor<fp16, [1,768,1,32]> l1_xr = mul(x=xMid,y=l1_rrms)[name=string("l1_xr")];
        tensor<fp16, [1,768,1,1]> l1_rw = const()[name=string("l1_rw"), val=tensor<fp16, [1,768,1,1]>(BLOBFILE(path=string("@model_path/weights/l1_rms1.bin"), offset=uint64(64)))];
        tensor<fp16, [1,768,1,32]> l1_xn = mul(x=l1_xr,y=l1_rw)[name=string("l1_xn")];
        tensor<fp16, [768,768,1,1]> l1_Wq = const()[name=string("l1_Wq"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/l1_wq.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> l1_Wk = const()[name=string("l1_Wk"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/l1_wk.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> l1_Wv = const()[name=string("l1_Wv"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/l1_wv.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> l1_Wo = const()[name=string("l1_Wo"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/l1_wo.bin"), offset=uint64(64)))];
        tensor<fp16, [1,768,1,32]> l1_qfFull = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l1_Wq,x=l1_xn)[name=string("l1_cq")];
        tensor<fp16, [1,768,1,32]> l1_kf = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l1_Wk,x=l1_xn)[name=string("l1_ck")];
        tensor<fp16, [1,768,1,32]> l1_vf = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l1_Wv,x=l1_xn)[name=string("l1_cv")];
        tensor<fp16, [1,768,1,1]> l1_qf = reduce_sum(x=l1_qfFull,axes=raxSp,keep_dims=kd)[name=string("l1_qf")];
        tensor<int32, [4]> l1_bMask = const()[name=string("l1_b_mask"), val=tensor<int32, [4]>([0,0,0,0])];
        tensor<int32, [4]> l1_szMask = const()[name=string("l1_sz_mask"), val=tensor<int32, [4]>([1,1,1,256])];
        tensor<fp16, [1,1,1,256]> l1_maskVec = slice_by_size(x=maskCache1,begin=l1_bMask,size=l1_szMask)[name=string("l1_mask_vec")];
        tensor<fp16, [1,1,1,256]> l1_kCh = reduce_sum(x=l1_kCache,axes=raxCh,keep_dims=kd)[name=string("l1_k_ch")];
        tensor<fp16, [1,1,1,256]> l1_vCh = reduce_sum(x=l1_vCache,axes=raxCh,keep_dims=kd)[name=string("l1_v_ch")];
        tensor<fp16, [1,1,1,1]> l1_kS = reduce_sum(x=l1_kCh,axes=raxSp,keep_dims=kd)[name=string("l1_k_s")];
        tensor<fp16, [1,1,1,1]> l1_vS = reduce_sum(x=l1_vCh,axes=raxSp,keep_dims=kd)[name=string("l1_v_s")];
        tensor<fp16, [1,1,1,256]> l1_mask0 = mul(x=l1_maskVec,y=zc)[name=string("l1_mask0")];
        tensor<fp16, [1,1,1,1]> l1_mS = reduce_sum(x=l1_mask0,axes=raxSp,keep_dims=kd)[name=string("l1_m_s")];
        tensor<fp16, [1,1,1,1]> l1_qS = reduce_sum(x=l1_qf,axes=raxCh,keep_dims=kd)[name=string("l1_q_s")];
        tensor<fp16, [1,768,1,1]> l1_ooProbe = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l1_Wo,x=l1_qf)[name=string("l1_co_probe")];
        tensor<fp16, [1,1,1,1]> l1_oS = reduce_sum(x=l1_ooProbe,axes=raxCh,keep_dims=kd)[name=string("l1_o_s")];
        tensor<fp16, [1,1,1,1]> l1_kv = add(x=l1_kS,y=l1_vS)[name=string("l1_kv")];
        tensor<fp16, [1,1,1,1]> l1_kvm1 = add(x=l1_kv,y=l1_mS)[name=string("l1_kvm1")];
        tensor<fp16, [1,1,1,1]> l1_kvm2 = add(x=l1_kvm1,y=l1_qS)[name=string("l1_kvm2")];
        tensor<fp16, [1,1,1,1]> l1_kvm = add(x=l1_kvm2,y=l1_oS)[name=string("l1_kvm")];
        tensor<fp16, [1,1,1,1]> l1_z = mul(x=l1_kvm,y=zc)[name=string("l1_z")];
        tensor<fp16, [1,768,1,32]> l1_x2 = add(x=xMid,y=l1_z)[name=string("l1_res")];
        tensor<fp16, [1,768,1,32]> l1_f_sq = mul(x=l1_x2,y=l1_x2)[name=string("l1_f_sq")];
        tensor<fp16, [1,1,1,32]> l1_f_ss = reduce_sum(x=l1_f_sq,axes=raxCh,keep_dims=kd)[name=string("l1_f_ss")];
        tensor<fp16, [1,1,1,32]> l1_f_ss2 = mul(x=l1_f_ss,y=invd)[name=string("l1_f_ss2")];
        tensor<fp16, [1,1,1,32]> l1_f_ss3 = add(x=l1_f_ss2,y=eps)[name=string("l1_f_ss3")];
        tensor<fp16, [1,1,1,32]> l1_f_rrms = pow(x=l1_f_ss3,y=nhalf)[name=string("l1_f_rrms")];
        tensor<fp16, [1,768,1,32]> l1_f_xr = mul(x=l1_x2,y=l1_f_rrms)[name=string("l1_f_xr")];
        tensor<fp16, [1,768,1,1]> l1_f_rw = const()[name=string("l1_f_rw"), val=tensor<fp16, [1,768,1,1]>(BLOBFILE(path=string("@model_path/weights/l1_rms2.bin"), offset=uint64(64)))];
        tensor<fp16, [1,768,1,32]> l1_f_xn = mul(x=l1_f_xr,y=l1_f_rw)[name=string("l1_f_xn")];
        tensor<fp16, [2048,768,1,1]> l1_W1 = const()[name=string("l1_W1"), val=tensor<fp16, [2048,768,1,1]>(BLOBFILE(path=string("@model_path/weights/l1_w1.bin"), offset=uint64(64)))];
        tensor<fp16, [2048,768,1,1]> l1_W3 = const()[name=string("l1_W3"), val=tensor<fp16, [2048,768,1,1]>(BLOBFILE(path=string("@model_path/weights/l1_w3.bin"), offset=uint64(64)))];
        tensor<fp16, [768,2048,1,1]> l1_W2 = const()[name=string("l1_W2"), val=tensor<fp16, [768,2048,1,1]>(BLOBFILE(path=string("@model_path/weights/l1_w2.bin"), offset=uint64(64)))];
        tensor<fp16, [1,2048,1,32]> l1_h1 = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l1_W1,x=l1_f_xn)[name=string("l1_c1")];
        tensor<fp16, [1,2048,1,32]> l1_h3 = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l1_W3,x=l1_f_xn)[name=string("l1_c3")];
        tensor<fp16, [1,2048,1,32]> l1_sig = sigmoid(x=l1_h1)[name=string("l1_sg")];
        tensor<fp16, [1,2048,1,32]> l1_silu = mul(x=l1_h1,y=l1_sig)[name=string("l1_si")];
        tensor<fp16, [1,2048,1,32]> l1_gate = mul(x=l1_silu,y=l1_h3)[name=string("l1_gt")];
        tensor<fp16, [1,768,1,32]> l1_y = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l1_W2,x=l1_gate)[name=string("l1_c2")];
        tensor<fp16, [1,768,1,32]> xNext = add(x=l1_x2,y=l1_y)[name=string("l1_res2")];
        int32 cax = const()[name=string("cax"), val=int32(1)];
        bool cid = const()[name=string("cid"), val=bool(false)];
        tensor<fp16, [1,1536,1,32]> kPacked = concat(axis=cax,interleave=cid,values=(kfL0,l1_kf))[name=string("k_cat")];
        tensor<fp16, [1,1536,1,32]> vPacked = concat(axis=cax,interleave=cid,values=(vfL0,l1_vf))[name=string("v_cat")];
    } -> (xNext,kPacked,vPacked);
}
