program(1.3)
[buildInfo = dict<string, string>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3505.4.1"}, {"coremltools-component-milinternal", ""}, {"coremltools-version", "9.0"}})]
{
    func main<ios18>(tensor<fp16, [1, 768, 1, 32]> x0, tensor<fp16, [1, 768, 1, 32]> x1, tensor<fp16, [1, 768, 1, 32]> stateIn) {
        tensor<int32, [1]> raxCh = const()[name=string("rax_ch"), val=tensor<int32, [1]>([1])];
        bool kd = const()[name=string("kd"), val=bool(true)];
        fp16 invd = const()[name=string("invd"), val=fp16(0.001302)];
        fp16 eps = const()[name=string("eps"), val=fp16(0.00001)];
        fp16 nhalf = const()[name=string("nhalf"), val=fp16(-0.5)];
        string pt = const()[name=string("pt"), val=string("valid")];
        tensor<int32, [2]> st = const()[name=string("st"), val=tensor<int32, [2]>([1,1])];
        tensor<int32, [4]> pd = const()[name=string("pd"), val=tensor<int32, [4]>([0,0,0,0])];
        tensor<int32, [2]> dl = const()[name=string("dl"), val=tensor<int32, [2]>([1,1])];
        int32 gr = const()[name=string("gr"), val=int32(1)];
        tensor<fp16, [1,768,1,1]> rw = const()[name=string("rw"), val=tensor<fp16, [1,768,1,1]>(BLOBFILE(path=string("@model_path/weights/rwkv_rms.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> Wx = const()[name=string("Wx"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/wx.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> Ws = const()[name=string("Ws"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/ws.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> Wd = const()[name=string("Wd"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/wd.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> Wo = const()[name=string("Wo"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/wo.bin"), offset=uint64(64)))];
        tensor<fp16, [1,768,1,32]> s0_sq = mul(x=x0,y=x0)[name=string("s0_sq")];
        tensor<fp16, [1,1,1,32]> s0_ss = reduce_sum(x=s0_sq,axes=raxCh,keep_dims=kd)[name=string("s0_ss")];
        tensor<fp16, [1,1,1,32]> s0_ss2 = mul(x=s0_ss,y=invd)[name=string("s0_ss2")];
        tensor<fp16, [1,1,1,32]> s0_ss3 = add(x=s0_ss2,y=eps)[name=string("s0_ss3")];
        tensor<fp16, [1,1,1,32]> s0_rrms = pow(x=s0_ss3,y=nhalf)[name=string("s0_rrms")];
        tensor<fp16, [1,768,1,32]> s0_xr = mul(x=x0,y=s0_rrms)[name=string("s0_xr")];
        tensor<fp16, [1,768,1,32]> s0_xn = mul(x=s0_xr,y=rw)[name=string("s0_xn")];
        tensor<fp16, [1,768,1,32]> s0_xMix = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=Wx,x=s0_xn)[name=string("s0_x_mix")];
        tensor<fp16, [1,768,1,32]> s0_sMix = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=Ws,x=stateIn)[name=string("s0_s_mix")];
        tensor<fp16, [1,768,1,32]> s0_carry = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=Wd,x=stateIn)[name=string("s0_carry")];
        tensor<fp16, [1,768,1,32]> s0_mixPre = add(x=s0_xMix,y=s0_sMix)[name=string("s0_mix_pre")];
        tensor<fp16, [1,768,1,32]> s0_gate = sigmoid(x=s0_mixPre)[name=string("s0_gate")];
        tensor<fp16, [1,768,1,32]> s0_gatedCarry = mul(x=s0_carry,y=s0_gate)[name=string("s0_gated_carry")];
        tensor<fp16, [1,768,1,32]> stateMid = add(x=s0_xMix,y=s0_gatedCarry)[name=string("stateMid")];
        tensor<fp16, [1,768,1,32]> s0_proj = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=Wo,x=stateMid)[name=string("s0_proj")];
        tensor<fp16, [1,768,1,32]> x0Next = add(x=x0,y=s0_proj)[name=string("x0Next")];
        tensor<fp16, [1,768,1,32]> s1_sq = mul(x=x1,y=x1)[name=string("s1_sq")];
        tensor<fp16, [1,1,1,32]> s1_ss = reduce_sum(x=s1_sq,axes=raxCh,keep_dims=kd)[name=string("s1_ss")];
        tensor<fp16, [1,1,1,32]> s1_ss2 = mul(x=s1_ss,y=invd)[name=string("s1_ss2")];
        tensor<fp16, [1,1,1,32]> s1_ss3 = add(x=s1_ss2,y=eps)[name=string("s1_ss3")];
        tensor<fp16, [1,1,1,32]> s1_rrms = pow(x=s1_ss3,y=nhalf)[name=string("s1_rrms")];
        tensor<fp16, [1,768,1,32]> s1_xr = mul(x=x1,y=s1_rrms)[name=string("s1_xr")];
        tensor<fp16, [1,768,1,32]> s1_xn = mul(x=s1_xr,y=rw)[name=string("s1_xn")];
        tensor<fp16, [1,768,1,32]> s1_xMix = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=Wx,x=s1_xn)[name=string("s1_x_mix")];
        tensor<fp16, [1,768,1,32]> s1_sMix = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=Ws,x=stateMid)[name=string("s1_s_mix")];
        tensor<fp16, [1,768,1,32]> s1_carry = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=Wd,x=stateMid)[name=string("s1_carry")];
        tensor<fp16, [1,768,1,32]> s1_mixPre = add(x=s1_xMix,y=s1_sMix)[name=string("s1_mix_pre")];
        tensor<fp16, [1,768,1,32]> s1_gate = sigmoid(x=s1_mixPre)[name=string("s1_gate")];
        tensor<fp16, [1,768,1,32]> s1_gatedCarry = mul(x=s1_carry,y=s1_gate)[name=string("s1_gated_carry")];
        tensor<fp16, [1,768,1,32]> stateOut = add(x=s1_xMix,y=s1_gatedCarry)[name=string("stateOut")];
        tensor<fp16, [1,768,1,32]> s1_proj = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=Wo,x=stateOut)[name=string("s1_proj")];
        tensor<fp16, [1,768,1,32]> x1Next = add(x=x1,y=s1_proj)[name=string("x1Next")];
    } -> (x0Next,x1Next,stateMid,stateOut);
}
