program(1.3)
[buildInfo = dict<string, string>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3505.4.1"}, {"coremltools-component-milinternal", ""}, {"coremltools-version", "9.0"}})]
{
    func main<ios18>(tensor<fp16, [1, 768, 1, 32]> x0, tensor<fp16, [1, 768, 1, 32]> x1, tensor<fp16, [1, 768, 1, 32]> stateIn0, tensor<fp16, [1, 768, 1, 32]> stateIn1, tensor<fp16, [1, 768, 1, 32]> stateIn2) {
        tensor<int32, [1]> raxCh = const()[name=string("rax_ch"), val=tensor<int32, [1]>([1])];
        bool kd = const()[name=string("kd"), val=bool(true)];
        fp16 invd = const()[name=string("invd"), val=fp16(0.001302)];
        fp16 eps = const()[name=string("eps"), val=fp16(0.00001)];
        fp16 nhalf = const()[name=string("nhalf"), val=fp16(-0.5)];
        string pt = const()[name=string("pt"), val=string("valid")];
        tensor<int32, [2]> st = const()[name=string("st"), val=tensor<int32, [2]>([1,1])];
        tensor<int32, [4]> pd = const()[name=string("pd"), val=tensor<int32, [4]>([0,0,0,0])];
        tensor<int32, [2]> dl = const()[name=string("dl"), val=tensor<int32, [2]>([1,1])];
        int32 gr = const()[name=string("gr"), val=int32(1)];
        tensor<fp16, [1,768,1,32]> l0s0_sq = mul(x=x0,y=x0)[name=string("l0s0_sq")];
        tensor<fp16, [1,1,1,32]> l0s0_ss = reduce_sum(x=l0s0_sq,axes=raxCh,keep_dims=kd)[name=string("l0s0_ss")];
        tensor<fp16, [1,1,1,32]> l0s0_ss2 = mul(x=l0s0_ss,y=invd)[name=string("l0s0_ss2")];
        tensor<fp16, [1,1,1,32]> l0s0_ss3 = add(x=l0s0_ss2,y=eps)[name=string("l0s0_ss3")];
        tensor<fp16, [1,1,1,32]> l0s0_rrms = pow(x=l0s0_ss3,y=nhalf)[name=string("l0s0_rrms")];
        tensor<fp16, [1,768,1,32]> l0s0_xr = mul(x=x0,y=l0s0_rrms)[name=string("l0s0_xr")];
        tensor<fp16, [1,768,1,1]> l0s0_rw = const()[name=string("l0s0_rw"), val=tensor<fp16, [1,768,1,1]>(BLOBFILE(path=string("@model_path/weights/rwkv_rms0.bin"), offset=uint64(64)))];
        tensor<fp16, [1,768,1,32]> l0s0_xn = mul(x=l0s0_xr,y=l0s0_rw)[name=string("l0s0_xn")];
        tensor<fp16, [768,768,1,1]> l0s0_Wx = const()[name=string("l0s0_Wx"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/wx0.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> l0s0_Ws = const()[name=string("l0s0_Ws"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/ws0.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> l0s0_Wd = const()[name=string("l0s0_Wd"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/wd0.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> l0s0_Wo = const()[name=string("l0s0_Wo"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/wo0.bin"), offset=uint64(64)))];
        tensor<fp16, [1,768,1,32]> l0s0_xMix = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l0s0_Wx,x=l0s0_xn)[name=string("l0s0_x_mix")];
        tensor<fp16, [1,768,1,32]> l0s0_sMix = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l0s0_Ws,x=stateIn0)[name=string("l0s0_s_mix")];
        tensor<fp16, [1,768,1,32]> l0s0_carry = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l0s0_Wd,x=stateIn0)[name=string("l0s0_carry")];
        tensor<fp16, [1,768,1,32]> l0s0_mixPre = add(x=l0s0_xMix,y=l0s0_sMix)[name=string("l0s0_mix_pre")];
        tensor<fp16, [1,768,1,32]> l0s0_gate = sigmoid(x=l0s0_mixPre)[name=string("l0s0_gate")];
        tensor<fp16, [1,768,1,32]> l0s0_gatedCarry = mul(x=l0s0_carry,y=l0s0_gate)[name=string("l0s0_gated_carry")];
        tensor<fp16, [1,768,1,32]> stateMid0 = add(x=l0s0_xMix,y=l0s0_gatedCarry)[name=string("stateMid0")];
        tensor<fp16, [1,768,1,32]> l0s0_proj = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l0s0_Wo,x=stateMid0)[name=string("l0s0_proj")];
        tensor<fp16, [1,768,1,32]> l0_x0Next = add(x=x0,y=l0s0_proj)[name=string("l0s0_x_next")];
        tensor<fp16, [1,768,1,32]> l1s0_sq = mul(x=l0_x0Next,y=l0_x0Next)[name=string("l1s0_sq")];
        tensor<fp16, [1,1,1,32]> l1s0_ss = reduce_sum(x=l1s0_sq,axes=raxCh,keep_dims=kd)[name=string("l1s0_ss")];
        tensor<fp16, [1,1,1,32]> l1s0_ss2 = mul(x=l1s0_ss,y=invd)[name=string("l1s0_ss2")];
        tensor<fp16, [1,1,1,32]> l1s0_ss3 = add(x=l1s0_ss2,y=eps)[name=string("l1s0_ss3")];
        tensor<fp16, [1,1,1,32]> l1s0_rrms = pow(x=l1s0_ss3,y=nhalf)[name=string("l1s0_rrms")];
        tensor<fp16, [1,768,1,32]> l1s0_xr = mul(x=l0_x0Next,y=l1s0_rrms)[name=string("l1s0_xr")];
        tensor<fp16, [1,768,1,1]> l1s0_rw = const()[name=string("l1s0_rw"), val=tensor<fp16, [1,768,1,1]>(BLOBFILE(path=string("@model_path/weights/rwkv_rms1.bin"), offset=uint64(64)))];
        tensor<fp16, [1,768,1,32]> l1s0_xn = mul(x=l1s0_xr,y=l1s0_rw)[name=string("l1s0_xn")];
        tensor<fp16, [768,768,1,1]> l1s0_Wx = const()[name=string("l1s0_Wx"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/wx1.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> l1s0_Ws = const()[name=string("l1s0_Ws"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/ws1.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> l1s0_Wd = const()[name=string("l1s0_Wd"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/wd1.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> l1s0_Wo = const()[name=string("l1s0_Wo"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/wo1.bin"), offset=uint64(64)))];
        tensor<fp16, [1,768,1,32]> l1s0_xMix = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l1s0_Wx,x=l1s0_xn)[name=string("l1s0_x_mix")];
        tensor<fp16, [1,768,1,32]> l1s0_sMix = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l1s0_Ws,x=stateIn1)[name=string("l1s0_s_mix")];
        tensor<fp16, [1,768,1,32]> l1s0_carry = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l1s0_Wd,x=stateIn1)[name=string("l1s0_carry")];
        tensor<fp16, [1,768,1,32]> l1s0_mixPre = add(x=l1s0_xMix,y=l1s0_sMix)[name=string("l1s0_mix_pre")];
        tensor<fp16, [1,768,1,32]> l1s0_gate = sigmoid(x=l1s0_mixPre)[name=string("l1s0_gate")];
        tensor<fp16, [1,768,1,32]> l1s0_gatedCarry = mul(x=l1s0_carry,y=l1s0_gate)[name=string("l1s0_gated_carry")];
        tensor<fp16, [1,768,1,32]> stateMid1 = add(x=l1s0_xMix,y=l1s0_gatedCarry)[name=string("stateMid1")];
        tensor<fp16, [1,768,1,32]> l1s0_proj = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l1s0_Wo,x=stateMid1)[name=string("l1s0_proj")];
        tensor<fp16, [1,768,1,32]> l1_x0Next = add(x=l0_x0Next,y=l1s0_proj)[name=string("l1s0_x_next")];
        tensor<fp16, [1,768,1,32]> l2s0_sq = mul(x=l1_x0Next,y=l1_x0Next)[name=string("l2s0_sq")];
        tensor<fp16, [1,1,1,32]> l2s0_ss = reduce_sum(x=l2s0_sq,axes=raxCh,keep_dims=kd)[name=string("l2s0_ss")];
        tensor<fp16, [1,1,1,32]> l2s0_ss2 = mul(x=l2s0_ss,y=invd)[name=string("l2s0_ss2")];
        tensor<fp16, [1,1,1,32]> l2s0_ss3 = add(x=l2s0_ss2,y=eps)[name=string("l2s0_ss3")];
        tensor<fp16, [1,1,1,32]> l2s0_rrms = pow(x=l2s0_ss3,y=nhalf)[name=string("l2s0_rrms")];
        tensor<fp16, [1,768,1,32]> l2s0_xr = mul(x=l1_x0Next,y=l2s0_rrms)[name=string("l2s0_xr")];
        tensor<fp16, [1,768,1,1]> l2s0_rw = const()[name=string("l2s0_rw"), val=tensor<fp16, [1,768,1,1]>(BLOBFILE(path=string("@model_path/weights/rwkv_rms2.bin"), offset=uint64(64)))];
        tensor<fp16, [1,768,1,32]> l2s0_xn = mul(x=l2s0_xr,y=l2s0_rw)[name=string("l2s0_xn")];
        tensor<fp16, [768,768,1,1]> l2s0_Wx = const()[name=string("l2s0_Wx"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/wx2.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> l2s0_Ws = const()[name=string("l2s0_Ws"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/ws2.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> l2s0_Wd = const()[name=string("l2s0_Wd"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/wd2.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> l2s0_Wo = const()[name=string("l2s0_Wo"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/wo2.bin"), offset=uint64(64)))];
        tensor<fp16, [1,768,1,32]> l2s0_xMix = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l2s0_Wx,x=l2s0_xn)[name=string("l2s0_x_mix")];
        tensor<fp16, [1,768,1,32]> l2s0_sMix = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l2s0_Ws,x=stateIn2)[name=string("l2s0_s_mix")];
        tensor<fp16, [1,768,1,32]> l2s0_carry = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l2s0_Wd,x=stateIn2)[name=string("l2s0_carry")];
        tensor<fp16, [1,768,1,32]> l2s0_mixPre = add(x=l2s0_xMix,y=l2s0_sMix)[name=string("l2s0_mix_pre")];
        tensor<fp16, [1,768,1,32]> l2s0_gate = sigmoid(x=l2s0_mixPre)[name=string("l2s0_gate")];
        tensor<fp16, [1,768,1,32]> l2s0_gatedCarry = mul(x=l2s0_carry,y=l2s0_gate)[name=string("l2s0_gated_carry")];
        tensor<fp16, [1,768,1,32]> stateMid2 = add(x=l2s0_xMix,y=l2s0_gatedCarry)[name=string("stateMid2")];
        tensor<fp16, [1,768,1,32]> l2s0_proj = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l2s0_Wo,x=stateMid2)[name=string("l2s0_proj")];
        tensor<fp16, [1,768,1,32]> x0Next = add(x=l1_x0Next,y=l2s0_proj)[name=string("l2s0_x_next")];
        tensor<fp16, [1,768,1,32]> l0s1_sq = mul(x=x1,y=x1)[name=string("l0s1_sq")];
        tensor<fp16, [1,1,1,32]> l0s1_ss = reduce_sum(x=l0s1_sq,axes=raxCh,keep_dims=kd)[name=string("l0s1_ss")];
        tensor<fp16, [1,1,1,32]> l0s1_ss2 = mul(x=l0s1_ss,y=invd)[name=string("l0s1_ss2")];
        tensor<fp16, [1,1,1,32]> l0s1_ss3 = add(x=l0s1_ss2,y=eps)[name=string("l0s1_ss3")];
        tensor<fp16, [1,1,1,32]> l0s1_rrms = pow(x=l0s1_ss3,y=nhalf)[name=string("l0s1_rrms")];
        tensor<fp16, [1,768,1,32]> l0s1_xr = mul(x=x1,y=l0s1_rrms)[name=string("l0s1_xr")];
        tensor<fp16, [1,768,1,1]> l0s1_rw = const()[name=string("l0s1_rw"), val=tensor<fp16, [1,768,1,1]>(BLOBFILE(path=string("@model_path/weights/rwkv_rms0.bin"), offset=uint64(64)))];
        tensor<fp16, [1,768,1,32]> l0s1_xn = mul(x=l0s1_xr,y=l0s1_rw)[name=string("l0s1_xn")];
        tensor<fp16, [768,768,1,1]> l0s1_Wx = const()[name=string("l0s1_Wx"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/wx0.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> l0s1_Ws = const()[name=string("l0s1_Ws"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/ws0.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> l0s1_Wd = const()[name=string("l0s1_Wd"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/wd0.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> l0s1_Wo = const()[name=string("l0s1_Wo"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/wo0.bin"), offset=uint64(64)))];
        tensor<fp16, [1,768,1,32]> l0s1_xMix = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l0s1_Wx,x=l0s1_xn)[name=string("l0s1_x_mix")];
        tensor<fp16, [1,768,1,32]> l0s1_sMix = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l0s1_Ws,x=stateMid0)[name=string("l0s1_s_mix")];
        tensor<fp16, [1,768,1,32]> l0s1_carry = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l0s1_Wd,x=stateMid0)[name=string("l0s1_carry")];
        tensor<fp16, [1,768,1,32]> l0s1_mixPre = add(x=l0s1_xMix,y=l0s1_sMix)[name=string("l0s1_mix_pre")];
        tensor<fp16, [1,768,1,32]> l0s1_gate = sigmoid(x=l0s1_mixPre)[name=string("l0s1_gate")];
        tensor<fp16, [1,768,1,32]> l0s1_gatedCarry = mul(x=l0s1_carry,y=l0s1_gate)[name=string("l0s1_gated_carry")];
        tensor<fp16, [1,768,1,32]> stateOut0 = add(x=l0s1_xMix,y=l0s1_gatedCarry)[name=string("stateOut0")];
        tensor<fp16, [1,768,1,32]> l0s1_proj = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l0s1_Wo,x=stateOut0)[name=string("l0s1_proj")];
        tensor<fp16, [1,768,1,32]> l0_x1Next = add(x=x1,y=l0s1_proj)[name=string("l0s1_x_next")];
        tensor<fp16, [1,768,1,32]> l1s1_sq = mul(x=l0_x1Next,y=l0_x1Next)[name=string("l1s1_sq")];
        tensor<fp16, [1,1,1,32]> l1s1_ss = reduce_sum(x=l1s1_sq,axes=raxCh,keep_dims=kd)[name=string("l1s1_ss")];
        tensor<fp16, [1,1,1,32]> l1s1_ss2 = mul(x=l1s1_ss,y=invd)[name=string("l1s1_ss2")];
        tensor<fp16, [1,1,1,32]> l1s1_ss3 = add(x=l1s1_ss2,y=eps)[name=string("l1s1_ss3")];
        tensor<fp16, [1,1,1,32]> l1s1_rrms = pow(x=l1s1_ss3,y=nhalf)[name=string("l1s1_rrms")];
        tensor<fp16, [1,768,1,32]> l1s1_xr = mul(x=l0_x1Next,y=l1s1_rrms)[name=string("l1s1_xr")];
        tensor<fp16, [1,768,1,1]> l1s1_rw = const()[name=string("l1s1_rw"), val=tensor<fp16, [1,768,1,1]>(BLOBFILE(path=string("@model_path/weights/rwkv_rms1.bin"), offset=uint64(64)))];
        tensor<fp16, [1,768,1,32]> l1s1_xn = mul(x=l1s1_xr,y=l1s1_rw)[name=string("l1s1_xn")];
        tensor<fp16, [768,768,1,1]> l1s1_Wx = const()[name=string("l1s1_Wx"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/wx1.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> l1s1_Ws = const()[name=string("l1s1_Ws"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/ws1.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> l1s1_Wd = const()[name=string("l1s1_Wd"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/wd1.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> l1s1_Wo = const()[name=string("l1s1_Wo"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/wo1.bin"), offset=uint64(64)))];
        tensor<fp16, [1,768,1,32]> l1s1_xMix = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l1s1_Wx,x=l1s1_xn)[name=string("l1s1_x_mix")];
        tensor<fp16, [1,768,1,32]> l1s1_sMix = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l1s1_Ws,x=stateMid1)[name=string("l1s1_s_mix")];
        tensor<fp16, [1,768,1,32]> l1s1_carry = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l1s1_Wd,x=stateMid1)[name=string("l1s1_carry")];
        tensor<fp16, [1,768,1,32]> l1s1_mixPre = add(x=l1s1_xMix,y=l1s1_sMix)[name=string("l1s1_mix_pre")];
        tensor<fp16, [1,768,1,32]> l1s1_gate = sigmoid(x=l1s1_mixPre)[name=string("l1s1_gate")];
        tensor<fp16, [1,768,1,32]> l1s1_gatedCarry = mul(x=l1s1_carry,y=l1s1_gate)[name=string("l1s1_gated_carry")];
        tensor<fp16, [1,768,1,32]> stateOut1 = add(x=l1s1_xMix,y=l1s1_gatedCarry)[name=string("stateOut1")];
        tensor<fp16, [1,768,1,32]> l1s1_proj = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l1s1_Wo,x=stateOut1)[name=string("l1s1_proj")];
        tensor<fp16, [1,768,1,32]> l1_x1Next = add(x=l0_x1Next,y=l1s1_proj)[name=string("l1s1_x_next")];
        tensor<fp16, [1,768,1,32]> l2s1_sq = mul(x=l1_x1Next,y=l1_x1Next)[name=string("l2s1_sq")];
        tensor<fp16, [1,1,1,32]> l2s1_ss = reduce_sum(x=l2s1_sq,axes=raxCh,keep_dims=kd)[name=string("l2s1_ss")];
        tensor<fp16, [1,1,1,32]> l2s1_ss2 = mul(x=l2s1_ss,y=invd)[name=string("l2s1_ss2")];
        tensor<fp16, [1,1,1,32]> l2s1_ss3 = add(x=l2s1_ss2,y=eps)[name=string("l2s1_ss3")];
        tensor<fp16, [1,1,1,32]> l2s1_rrms = pow(x=l2s1_ss3,y=nhalf)[name=string("l2s1_rrms")];
        tensor<fp16, [1,768,1,32]> l2s1_xr = mul(x=l1_x1Next,y=l2s1_rrms)[name=string("l2s1_xr")];
        tensor<fp16, [1,768,1,1]> l2s1_rw = const()[name=string("l2s1_rw"), val=tensor<fp16, [1,768,1,1]>(BLOBFILE(path=string("@model_path/weights/rwkv_rms2.bin"), offset=uint64(64)))];
        tensor<fp16, [1,768,1,32]> l2s1_xn = mul(x=l2s1_xr,y=l2s1_rw)[name=string("l2s1_xn")];
        tensor<fp16, [768,768,1,1]> l2s1_Wx = const()[name=string("l2s1_Wx"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/wx2.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> l2s1_Ws = const()[name=string("l2s1_Ws"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/ws2.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> l2s1_Wd = const()[name=string("l2s1_Wd"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/wd2.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> l2s1_Wo = const()[name=string("l2s1_Wo"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/wo2.bin"), offset=uint64(64)))];
        tensor<fp16, [1,768,1,32]> l2s1_xMix = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l2s1_Wx,x=l2s1_xn)[name=string("l2s1_x_mix")];
        tensor<fp16, [1,768,1,32]> l2s1_sMix = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l2s1_Ws,x=stateMid2)[name=string("l2s1_s_mix")];
        tensor<fp16, [1,768,1,32]> l2s1_carry = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l2s1_Wd,x=stateMid2)[name=string("l2s1_carry")];
        tensor<fp16, [1,768,1,32]> l2s1_mixPre = add(x=l2s1_xMix,y=l2s1_sMix)[name=string("l2s1_mix_pre")];
        tensor<fp16, [1,768,1,32]> l2s1_gate = sigmoid(x=l2s1_mixPre)[name=string("l2s1_gate")];
        tensor<fp16, [1,768,1,32]> l2s1_gatedCarry = mul(x=l2s1_carry,y=l2s1_gate)[name=string("l2s1_gated_carry")];
        tensor<fp16, [1,768,1,32]> stateOut2 = add(x=l2s1_xMix,y=l2s1_gatedCarry)[name=string("stateOut2")];
        tensor<fp16, [1,768,1,32]> l2s1_proj = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=l2s1_Wo,x=stateOut2)[name=string("l2s1_proj")];
        tensor<fp16, [1,768,1,32]> x1Next = add(x=l1_x1Next,y=l2s1_proj)[name=string("l2s1_x_next")];
    } -> (x0Next,x1Next,stateMid0,stateMid1,stateMid2,stateOut0,stateOut1,stateOut2);
}
