program(1.3)
[buildInfo = dict<string, string>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3505.4.1"}, {"coremltools-component-milinternal", ""}, {"coremltools-version", "9.0"}})]
{
    func main<ios18>(tensor<fp16, [1, 7680, 1, 256]> x) {
        tensor<int32, [4]> sz_sc = const()[name=string("szsc"), val=tensor<int32, [4]>([1,3072,1,256])];
        tensor<int32, [4]> b0 = const()[name=string("b0"), val=tensor<int32, [4]>([0,0,0,0])];
        tensor<fp16, [1,3072,1,256]> pf = slice_by_size(x=x,begin=b0,size=sz_sc)[name=string("s0")];
        tensor<int32, [4]> b1 = const()[name=string("b1"), val=tensor<int32, [4]>([0,3072,0,0])];
        tensor<fp16, [1,3072,1,256]> dpf = slice_by_size(x=x,begin=b1,size=sz_sc)[name=string("s1")];
        tensor<int32, [4]> sz_d = const()[name=string("szd"), val=tensor<int32, [4]>([1,768,1,256])];
        tensor<int32, [4]> b2 = const()[name=string("b2"), val=tensor<int32, [4]>([0,6144,0,0])];
        tensor<fp16, [1,768,1,256]> qf = slice_by_size(x=x,begin=b2,size=sz_d)[name=string("s2")];
        tensor<int32, [4]> b3 = const()[name=string("b3"), val=tensor<int32, [4]>([0,6912,0,0])];
        tensor<fp16, [1,768,1,256]> kf = slice_by_size(x=x,begin=b3,size=sz_d)[name=string("s3")];
        tensor<int32, [4]> ssh = const()[name=string("ssh"), val=tensor<int32, [4]>([1,12,256,256])];
        tensor<fp16, [1,12,256,256]> probs = reshape(shape=ssh,x=pf)[name=string("rp")];
        tensor<fp16, [1,12,256,256]> dp = reshape(shape=ssh,x=dpf)[name=string("rdp")];
        tensor<int32, [4]> rsh = const()[name=string("rsh"), val=tensor<int32, [4]>([1,12,64,256])];
        tensor<int32, [4]> pm = const()[name=string("pm"), val=tensor<int32, [4]>([0,1,3,2])];
        tensor<fp16, [1,12,64,256]> qr = reshape(shape=rsh,x=qf)[name=string("rq")];
        tensor<fp16, [1,12,256,64]> q = transpose(perm=pm,x=qr)[name=string("tq")];
        tensor<fp16, [1,12,64,256]> kr = reshape(shape=rsh,x=kf)[name=string("rk")];
        tensor<fp16, [1,12,256,64]> k = transpose(perm=pm,x=kr)[name=string("tk")];
        tensor<fp16, [1,12,256,256]> pdp = mul(x=probs,y=dp)[name=string("pdp")];
        tensor<int32, [1]> rax = const()[name=string("rax"), val=tensor<int32, [1]>([-1])];
        bool kd = const()[name=string("kd"), val=bool(true)];
        tensor<fp16, [1,12,256,1]> spdp = reduce_sum(x=pdp,axes=rax,keep_dims=kd)[name=string("rs")];
        tensor<fp16, [1,12,256,256]> dps = sub(x=dp,y=spdp)[name=string("dps")];
        tensor<fp16, [1,12,256,256]> ds0 = mul(x=probs,y=dps)[name=string("ds0")];
        fp16 scv = const()[name=string("scv"), val=fp16(0.125000)];
        tensor<fp16, [1,12,256,256]> ds = mul(x=ds0,y=scv)[name=string("ds")];
        bool bF = const()[name=string("bF"), val=bool(false)];
        bool bT = const()[name=string("bT"), val=bool(true)];
        tensor<fp16, [1,12,256,64]> dq4 = matmul(transpose_x=bF,transpose_y=bF,x=ds,y=k)[name=string("dq")];
        tensor<fp16, [1,12,256,64]> dk4 = matmul(transpose_x=bT,transpose_y=bF,x=ds,y=q)[name=string("dk")];
        tensor<fp16, [1,12,64,256]> dqt = transpose(perm=pm,x=dq4)[name=string("dqt")];
        tensor<fp16, [1,12,64,256]> dkt = transpose(perm=pm,x=dk4)[name=string("dkt")];
        tensor<int32, [4]> fs = const()[name=string("fs"), val=tensor<int32, [4]>([1,768,1,256])];
        tensor<fp16, [1,768,1,256]> dqf = reshape(shape=fs,x=dqt)[name=string("dqf")];
        tensor<fp16, [1,768,1,256]> dkf = reshape(shape=fs,x=dkt)[name=string("dkf")];
        int32 cax = const()[name=string("cax"), val=int32(1)];
        bool cid = const()[name=string("cid"), val=bool(false)];
        tensor<fp16, [1,1536,1,256]> out = concat(axis=cax,interleave=cid,values=(dqf,dkf))[name=string("cat")];
    } -> (out);
}
