program(1.3)
[buildInfo = dict<string, string>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3505.4.1"}, {"coremltools-component-milinternal", ""}, {"coremltools-version", "9.0"}})]
{
    func main<ios18>(tensor<fp16, [1, 768, 1, 256]> x) {
        tensor<fp16, [1,768,1,256]> sq = mul(x=x,y=x)[name=string("sq")];
        tensor<int32, [1]> rax = const()[name=string("rax"), val=tensor<int32, [1]>([1])];
        bool kd = const()[name=string("kd"), val=bool(true)];
        tensor<fp16, [1,1,1,256]> ss = reduce_sum(x=sq,axes=rax,keep_dims=kd)[name=string("ss")];
        fp16 invd = const()[name=string("invd"), val=fp16(0.001302)];
        tensor<fp16, [1,1,1,256]> ss2 = mul(x=ss,y=invd)[name=string("ss2")];
        fp16 eps = const()[name=string("eps"), val=fp16(0.00001)];
        tensor<fp16, [1,1,1,256]> ss3 = add(x=ss2,y=eps)[name=string("ss3")];
        fp16 nhalf = const()[name=string("nhalf"), val=fp16(-0.5)];
        tensor<fp16, [1,1,1,256]> rrms = pow(x=ss3,y=nhalf)[name=string("rrms")];
        tensor<fp16, [1,768,1,256]> xr = mul(x=x,y=rrms)[name=string("xr")];
        tensor<fp16, [1,768,1,1]> rw = const()[name=string("rw"), val=tensor<fp16, [1,768,1,1]>(BLOBFILE(path=string("@model_path/weights/rms1.bin"), offset=uint64(64)))];
        tensor<fp16, [1,768,1,256]> xn = mul(x=xr,y=rw)[name=string("xn")];
        string pt = const()[name=string("pt"), val=string("valid")];
        tensor<int32, [2]> st = const()[name=string("st"), val=tensor<int32, [2]>([1,1])];
        tensor<int32, [4]> pd = const()[name=string("pd"), val=tensor<int32, [4]>([0,0,0,0])];
        tensor<int32, [2]> dl = const()[name=string("dl"), val=tensor<int32, [2]>([1,1])];
        int32 gr = const()[name=string("gr"), val=int32(1)];
        tensor<fp16, [768,768,1,1]> Wq = const()[name=string("Wq"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/wq.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> Wk = const()[name=string("Wk"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/wk.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> Wv = const()[name=string("Wv"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/wv.bin"), offset=uint64(64)))];
        tensor<fp16, [768,768,1,1]> Wo = const()[name=string("Wo"), val=tensor<fp16, [768,768,1,1]>(BLOBFILE(path=string("@model_path/weights/wo.bin"), offset=uint64(64)))];
        tensor<fp16, [1,768,1,256]> qf = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=Wq,x=xn)[name=string("cq")];
        tensor<fp16, [1,768,1,256]> kf = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=Wk,x=xn)[name=string("ck")];
        tensor<fp16, [1,768,1,256]> vf = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=Wv,x=xn)[name=string("cv")];
        tensor<int32, [4]> qsh = const()[name=string("qsh"), val=tensor<int32, [4]>([1,12,64,256])];
        tensor<int32, [4]> pm = const()[name=string("pm"), val=tensor<int32, [4]>([0,1,3,2])];
        tensor<fp16, [1,12,64,256]> q4 = reshape(shape=qsh,x=qf)[name=string("rq")];
        tensor<fp16, [1,12,256,64]> q = transpose(perm=pm,x=q4)[name=string("tq")];
        tensor<fp16, [1,12,64,256]> k4 = reshape(shape=qsh,x=kf)[name=string("rk")];
        tensor<fp16, [1,12,256,64]> k = transpose(perm=pm,x=k4)[name=string("tk")];
        tensor<fp16, [1,12,64,256]> v4 = reshape(shape=qsh,x=vf)[name=string("rv")];
        tensor<fp16, [1,12,256,64]> v = transpose(perm=pm,x=v4)[name=string("tv")];
        bool tx = const()[name=string("tx"), val=bool(false)];
        bool ty = const()[name=string("ty"), val=bool(true)];
        tensor<fp16, [1,12,256,256]> sc1 = matmul(transpose_x=tx,transpose_y=ty,x=q,y=k)[name=string("mm1")];
        fp16 scv = const()[name=string("scv"), val=fp16(0.125000)];
        tensor<fp16, [1,12,256,256]> sc2 = mul(x=sc1,y=scv)[name=string("scl")];
        tensor<fp16, [1,1,256,256]> cm = const()[name=string("cm"), val=tensor<fp16, [1,1,256,256]>(BLOBFILE(path=string("@model_path/weights/mask.bin"), offset=uint64(64)))];
        tensor<fp16, [1,12,256,256]> ms = add(x=sc2,y=cm)[name=string("msk")];
        int32 sax = const()[name=string("sax"), val=int32(-1)];
        tensor<fp16, [1,12,256,256]> aw = softmax(axis=sax,x=ms)[name=string("sm")];
        tensor<fp16, [1,12,256,64]> a4 = matmul(transpose_x=tx,transpose_y=tx,x=aw,y=v)[name=string("mm2")];
        tensor<fp16, [1,12,64,256]> at = transpose(perm=pm,x=a4)[name=string("ta")];
        tensor<int32, [4]> os = const()[name=string("os"), val=tensor<int32, [4]>([1,768,1,256])];
        tensor<fp16, [1,768,1,256]> af = reshape(shape=os,x=at)[name=string("ra")];
        tensor<fp16, [1,768,1,256]> oo = conv(dilations=dl,groups=gr,pad=pd,pad_type=pt,strides=st,weight=Wo,x=af)[name=string("co")];
        tensor<fp16, [1,768,1,256]> out = add(x=x,y=oo)[name=string("res")];
    } -> (out);
}
